plantsuwa/app/controllers/climates_controller.rb

  def index
    @climates = Climate.paginate(page: params[:page], per_page: 10)
---
SELECT "climates".* FROM "climates"
SELECT COUNT(*) FROM "climates"

  def create
    @climate = Climate.new(climate_params)
    if @climate.save
---
INSERT INTO "climates" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 20 Aug 2014 19:20:53 AWST +08:00], ["name", "Hot"], ["updated_at", Wed, 20 Aug 2014 19:20:53 AWST +08:00]]

  def show
    @climate = Climate.find(params[:id])
---
SELECT "climates".* FROM "climates" WHERE "climates"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @climate = Climate.find(params[:id])
---
SELECT "climates".* FROM "climates" WHERE "climates"."id" = ? LIMIT 1  [["id", "4"]]

  def update
    @climate = Climate.find(params[:id])

    if @climate.update(climate_params)
---
SELECT "climates".* FROM "climates" WHERE "climates"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "climates" SET "name" = ?, "updated_at" = ? WHERE "climates"."id" = 4  [["name", "Drys"], ["updated_at", Wed, 20 Aug 2014 19:22:59 AWST +08:00]]

  def destroy
    @climate = Climate.find(params[:id])
    @climate.destroy
---
SELECT "climates".* FROM "climates" WHERE "climates"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "climates" WHERE "climates"."id" = ?  [["id", 4]]