plantsuwa/app/controllers/current_plants_controller.rb

SELECT "current_plants".* FROM "current_plants"
---
  def index
    @current_plants = CurrentPlant.all

INSERT INTO "current_plants" ("additional_info", "architectural_info", "architectural_uses", "characteristics", "common_name", "conservation", "created_at", "culture", "description", "discovered_by", "environment", "general_info", "horticulture", "identification", "location_name", "name", "named_by", "physical", "scientific_name", "species", "subspecies", "synonym", "updated_at", "wildlife") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @current_plant = CurrentPlant.new(current_plant_params)

    @current_plant.save

SELECT "current_plants".* FROM "current_plants" WHERE "current_plants"."id" = ? LIMIT 1  [["id", "index"]]
---
  def show
    @current_plant = CurrentPlant.find(params[:id])

SELECT "current_plants".* FROM "current_plants" WHERE "current_plants"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @current_plant = CurrentPlant.find(params[:id])

SELECT "current_plants".* FROM "current_plants" WHERE "current_plants"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @current_plant = CurrentPlant.find(params[:id])