plantsuwa/app/controllers/families_controller.rb

  def index
    @families = Family.all
---
SELECT "families".* FROM "families"

  def create
    @family = Family.new(family_params)

    @family.save
---
INSERT INTO "families" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 20 Aug 2014 19:34:52 AWST +08:00], ["name", "Acanthaceae"], ["updated_at", Wed, 20 Aug 2014 19:34:52 AWST +08:00]]

  def destroy
    @family = Family.find(params[:id])
    @family.destroy
---
SELECT "families".* FROM "families" WHERE "families"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "families" WHERE "families"."id" = ?  [["id", 3]]