plantsuwa/app/controllers/flower_colours_controller.rb

  def index
    @flower_colours = FlowerColour.paginate(page: params[:page], per_page: 10)
---
SELECT "flower_colours".* FROM "flower_colours"
SELECT COUNT(*) FROM "flower_colours"

  def create
    @flower_colour = FlowerColour.new(flower_colour_params)
    if @flower_colour.save
---
INSERT INTO "flower_colours" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 20 Aug 2014 19:50:25 AWST +08:00], ["name", "Red"], ["updated_at", Wed, 20 Aug 2014 19:50:25 AWST +08:00]]

  def destroy
    @flower_colour = FlowerColour.find(params[:id])
    @flower_colour.destroy
---
SELECT "flower_colours".* FROM "flower_colours" WHERE "flower_colours"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "flower_colours" WHERE "flower_colours"."id" = ?  [["id", 5]]