plantsuwa/app/controllers/leaf_colours_controller.rb

  def index
    @leaf_colours = LeafColour.paginate(page: params[:page], per_page: 10)
---
SELECT "leaf_colours".* FROM "leaf_colours"
SELECT COUNT(*) FROM "leaf_colours"

  def create
    @leaf_colour = LeafColour.new(leaf_colour_params)
    if @leaf_colour.save
---
INSERT INTO "leaf_colours" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 20 Aug 2014 20:14:59 AWST +08:00], ["name", "Green"], ["updated_at", Wed, 20 Aug 2014 20:14:59 AWST +08:00]]