plantsuwa/app/controllers/origins_controller.rb

  def index
    @origins = Origin.paginate(page: params[:page], per_page: 10)
---
SELECT "origins".* FROM "origins"
SELECT COUNT(*) FROM "origins"

  def create
    @origin = Origin.new(origin_params)
    if @origin.save
---
INSERT INTO "origins" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 20 Aug 2014 20:15:50 AWST +08:00], ["name", "Western Australian"], ["updated_at", Wed, 20 Aug 2014 20:15:50 AWST +08:00]]