plantsuwa/app/controllers/sizes_controller.rb

SELECT "sizes".* FROM "sizes"
SELECT COUNT(*) FROM "sizes"
---
  def index
    @sizes = Size.paginate(page: params[:page], per_page: 15)

INSERT INTO "sizes" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 20 Aug 2014 20:12:17 AWST +08:00], ["name", "Small"], ["updated_at", Wed, 20 Aug 2014 20:12:17 AWST +08:00]]
---
  def create
    @size = Size.new(size_params)
    if @size.save

SELECT "sizes".* FROM "sizes" WHERE "sizes"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "sizes" WHERE "sizes"."id" = ?  [["id", 4]]
---
  def destroy
    @size = Size.find(params[:id])
    @size.destroy