plantsuwa/app/controllers/soil_types_controller.rb

  def index
    @soil_types = SoilType.paginate(page: params[:page], per_page: 10)
---
SELECT "soil_types".* FROM "soil_types"
SELECT COUNT(*) FROM "soil_types"

  def create
    @soil_type = SoilType.new(soil_type_params)
    if @soil_type.save
---
INSERT INTO "soil_types" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 20 Aug 2014 20:11:25 AWST +08:00], ["name", "Quindalup"], ["updated_at", Wed, 20 Aug 2014 20:11:25 AWST +08:00]]