plantsuwa/app/controllers/types_controller.rb

SELECT "types".* FROM "types"
SELECT COUNT(*) FROM "types"
---
  def index
    @types = Type.paginate(page: params[:page], per_page: 10)

INSERT INTO "types" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 20 Aug 2014 20:06:48 AWST +08:00], ["name", "Climber"], ["updated_at", Wed, 20 Aug 2014 20:06:48 AWST +08:00]]
---
  def create
    @type = Type.new(type_params)
    if @type.save